{"posts":{"530c30ee-54b9-4bab-8ae3-cdba9f659f05":{"content":"<p>Nouveau challenge imposé à moi-même: 300 mots par jour. J’ai toujours eu du mal à écrire régulièrement alors je me redonne un nouvel objectif, très modeste, et voir ce qu’il peut en découler. J'écrirai sur tout et n’importe quoi, aucune restriction à ce niveau-la. Pas besoin de davantage de contrainte pour l’instant, la régularité primant sur la quantité et la qualité. Évidemment, j'espère que 2 ou 3 idées pas trop stupides finiront par sortir de ces gesticulations mentales. Mon cerveau étant vide actuellement, il va falloir le repeupler lentement en plantant des graines d'intérêt ici ou là, et permettre de récolter plus tard les fruits d’une réflexion sur des sujets divers et variés.</p>\n<p><br></p>\n<p>Les 2 trends qui semblent acaparer le forum social actuellement dans mon prisme de lecture du monde semblent etre le conflit israelo-palestinien, a propos duquel je ne suis pas certain d’avoir envie d’ecrire et, beaucoup plus recent, l’eviction de Sam Altman a la tete de OpenAI. Je ne suis pas certains de tenir les tenants et les aboutissants de cette surprise du monde de la tech, n’ayant jamais que suivi de très loin les prouesses de l’entreprise au-travers de ChatGPT, et ne l’ayant moi-même que très peu utilisé (il faudrait que je remédie à cet état de fait à l'avenir). Le grand gagnant qui se dessine en ce lundi de novembre semble etre Microsoft, raflant un des patrons les plus influents du monde numérique ainsi que des centaines d'employés du milieu de l’intelligence artificielle, permettant à la firme de Redmond d’asseoir une assise confortable pour le futur de l’intelligence artificielle dans leurs produits existants.</p>\n<p><br></p>\n<p>Cet événement a une portée très circonscrite au monde de la tech actuellement et aucune commune mesure avec le conflit dans la bande de Gaza mais il pourrait bien à l'avenir infuser dans le quotidien de la majorité d’entre-nous. Férus de technologies ou non.</p>","date":"20 novembre 2023"},"5c22810f-2cd1-4e70-95c2-a55e7862485e":{"content":"<p>Deuxième jour, et j’ai déjà bien failli ne pas écrire aujourd’hui. Ça commence bien.</p>\n<p><br></p>\n<p>Petite prise de sang pour confirmer ou infirmer un début de cholestérol. Autant il y a 6 mois, l’information m’avait beaucoup étonné, autant aujourd’hui si les résultats sont mauvais je ne serai pas surpris tant mon inactivité physique a été lancinante ces derniers mois. Je crois bien que je n’ai jamais été aussi peu actif de toute ma vie. Ca n’est évidemment pas un constat glorieux et je crois que je vais enfin sortir de cette phase de torpeur mais me connaissant il y en aura malheureusement probablement d’autres. Dire que j’alterne des phases ou je cours 10 kilomètres tous les 2 jours avec ces périodes-ci en dit long sur mon incapacité à tenir un cap sur le long terme. Mais comme on dit, on ne devrait pas juger un homme au nombre de fois qu’il tombe mais au nombre de fois qu’il se relève. Alors on se relève… </p>\n<p>J'ai également continué mes recherches pour un nouvel endroit pour travailler, en dehors de ma chambre car, forcé de constater que ça n'a pas été très efficace cette année. Sortir mon cul le matin pourrait peut-être bien m’aider à être plus productif. J’ai deux pistes que je vais vraisemblablement aller explorer demain. Une fois fait, l'idée sera de porter mon site-CV de nouveau sur NextJS histoire de faire un truc facile pour me remettre dans le bain et en profiter pour découvrir les nouvelles fonctionnalités de routeur proposées par NextJS 13 à côté desquelles je suis un peu passe pour le moment. Ça sera aussi l’occasion de mettre un place un petit système de blog simple pour publier ces billets. Enfin, je pourrai décider de me remettre à bosser sur mon jeu ou de réfléchir à un autre jeu qui me trotte dans la tête en ce moment. Ou encore, dieu m’en préserve, de chercher du taf et d’avoir un salaire - mais ne poussons pas le bouchon trop loin.</p>","date":"21 novembre 2023"}}}